app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Get started with Bootstrap"], ["created_at", "2023-02-09 13:48:49.665799"], ["updated_at", "2023-02-09 13:48:49.665799"]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "updated_at" = ? WHERE "articles"."id" = ?  [["updated_at", "2023-02-09 13:48:49.674646"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)