app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("user_id", "title", "publish", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["title", "Get started with Bootstrap"], ["publish", "2023-02-01"], ["created_at", "2023-02-09 14:46:34.724331"], ["updated_at", "2023-02-09 14:46:34.724331"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "updated_at" = ? WHERE "posts"."id" = ?  [["updated_at", "2023-02-09 14:55:44.888980"], ["id", 2]]